Repository: FiraolLemma/A_github_local_poultry
Catalog: items/locale/*/LC_MESSAGES/django.po
Languages: am

source: Create New Item
am: አዲስ ንጥል ፍጠር

source: Save Item
am: ንጥል አስቀምጥ

source: Contact Seller
am: ለሻጭ ያግኙ

source: Price: ETB
am: ዋጋ፡ ብር

source: Gallery
am: ጋለሪ

source: Poultry Marketplace
am: የዶሮ ገበያ

source: Sell Item
am: ንጥል ሽይ

source: ETB
am: ብር

source: Posted
am: ተለጠፈ

source: No poultry items available yet
am: እስካሁን ድረስ የዶሮ ንጥሎች አልተገኙም

source: Be the first to sell
am: የመጀመሪያው ሻጭ ይሁኑ

source: Please login to add items
am: ንጥሎችን ለመጨመር እባክዎ ይግቡ

source: First
am: መጀመሪያ

source: Previous
am: ቀዳሚ

source: Page
am: ገፅ

source: of
am: ከ
